app/views/songs/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= form.label :category_id, class:"form-label" %>
    <%= form.collection_select(:category_id, Category.all, :id, :name, {}, {:class=>'form-select'}) %>