app/views/songs/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."song_id" = $1  [["song_id", 3]]
---
        <%if user_signed_in? %>
        <% pre_like = song.likes.find { |like| like.user_id == current_user.id} %>

SELECT "likes".* FROM "likes" WHERE "likes"."song_id" = $1  [["song_id", 2]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."song_id" = $1  [["song_id", 2]]
---
  <div class="d-inline">
    <%= song.likes.count %> <%= (song.likes.count) == 1 ? 'Like' : 'Likes'%>