app/controllers/likes_controller.rb

    def create
        if already_liked?
            flash[:notice] = "You can't like more than once"
          else
    @song.likes.create(user_id: current_user.id)
---
INSERT INTO "likes" ("song_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["song_id", 2], ["user_id", 2], ["created_at", "2022-01-18 17:07:04.591829"], ["updated_at", "2022-01-18 17:07:04.591829"]]

    def destroy
    if !(already_liked?)
      flash[:notice] = "Cannot unlike"
    else
      @like.destroy
---
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 2]]

  def already_liked?
    Like.where(user_id: current_user.id, song_id:
    params[:song_id]).exists?
---
SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."song_id" = $2 LIMIT $3  [["user_id", 2], ["song_id", 2], ["LIMIT", 1]]

  def find_like
    @like = @song.likes.find(params[:id])
---
SELECT "likes".* FROM "likes" WHERE "likes"."song_id" = $1 AND "likes"."id" = $2 LIMIT $3  [["song_id", 2], ["id", 2], ["LIMIT", 1]]

  def find_song
    @song = Song.find(params[:song_id])
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]