app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
---
  def index
    @songs = Song.all.reverse

INSERT INTO "songs" ("title", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "krneki"], ["created_at", "2021-12-16 08:11:18.017610"], ["updated_at", "2021-12-16 08:11:18.017610"], ["user_id", 1]]
---
  def create
    @song = Song.new(song_params)
    @song.user = current_user

    respond_to do |format|
      if @song.save

UPDATE "songs" SET "updated_at" = $1, "audio" = $2 WHERE "songs"."id" = $3  [["updated_at", "2022-01-18 19:52:38.567121"], ["audio", "Tim_Minchin___Rock_n_Roll_Nerd.ogg"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @song.update(song_params)

DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 3]]
---
  def destroy
    @song.destroy